Revit 2027 API
PanelScheduleTemplate.IsValidType(PanelScheduleType) Method
 Checks if given type is valid for this panel schedule template element.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool IsValidType(
	PanelScheduleType panelScheduleType
)
Public Shared Function IsValidType (
	panelScheduleType As PanelScheduleType
) As Boolean
public:
static bool IsValidType(
	PanelScheduleType panelScheduleType
)
static member IsValidType :
        panelScheduleType : PanelScheduleType -> bool
Parameters
panelScheduleType PanelScheduleType
 The given type to check.
Return Value
Boolean
 True if panel schedule template can have a type assigned and this type is valid for this element, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Remarks
 A type is valid for a panel schedule template element if it is defined by the PanelScheduleType class. Note: PanelScheduleType::Enum::Unknown is not a valid type, it is used for initializing the variable of the PanelScheduleType::Enum.
See Also
Reference
PanelScheduleTemplate Class
IsValidType Overload
Autodesk.Revit.DB.Electrical Namespace